nxp-mcuxpresso/mcux-sdk/devices/LPC864/LPC864.h
#define SWM_PINASSIGN_DATA_DATA1_MASK            (0xFF00U)
#define SWM_PINASSIGN_DATA_DATA1_SHIFT           (8U)
/*! DATA1 - T0_CAP0 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_31 (= 0x1F) and from PIO1_0 (=0x20)
 *    to PIO1_21(=0x35).
 */
#define SWM_PINASSIGN_DATA_DATA1(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_DATA1_SHIFT)) & SWM_PINASSIGN_DATA_DATA1_MASK)

#define SWM_PINASSIGN_DATA_DATA2_MASK            (0xFF0000U)
#define SWM_PINASSIGN_DATA_DATA2_SHIFT           (16U)
/*! DATA2 - T0_CAP1 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_31 (= 0x1F) and from PIO1_0 (=0x20)
 *    to PIO1_21(=0x35).
 */
#define SWM_PINASSIGN_DATA_DATA2(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_DATA2_SHIFT)) & SWM_PINASSIGN_DATA_DATA2_MASK)

#define SWM_PINASSIGN_DATA_DATA3_MASK            (0xFF000000U)
#define SWM_PINASSIGN_DATA_DATA3_SHIFT           (24U)
/*! DATA3 - T0_CAP2 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_31 (= 0x1F) and from PIO1_0 (=0x20)
 *    to PIO1_21(=0x35).
 */
#define SWM_PINASSIGN_DATA_DATA3(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_DATA3_SHIFT)) & SWM_PINASSIGN_DATA_DATA3_MASK)
/*! @} */

/* The count of SWM_PINASSIGN_DATA */
#define SWM_PINASSIGN_DATA_COUNT                 (9U)

/*! @name FTM_PINASSIGN0 - FlexTimer Pin assign register 0 Assign movable functions. */
/*! @{ */

#define SWM_FTM_PINASSIGN0_FTM0_EXTCLK_MASK      (0x3U)
#define SWM_FTM_PINASSIGN0_FTM0_EXTCLK_SHIFT     (0U)
/*! FTM0_EXTCLK - Assign movable function FTM0_EXTCLK 00 = Selection 0 function pins 01 = Selection
 *    1 function pins 10 = Selection 2 function pins 11 = Selection 3 function pins
 */
#define SWM_FTM_PINASSIGN0_FTM0_EXTCLK(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_EXTCLK_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_EXTCLK_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH0_MASK         (0xCU)
#define SWM_FTM_PINASSIGN0_FTM0_CH0_SHIFT        (2U)
/*! FTM0_CH0 - Assign movable function FTM0_CH0 */
#define SWM_FTM_PINASSIGN0_FTM0_CH0(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH0_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH0_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH1_MASK         (0x30U)
#define SWM_FTM_PINASSIGN0_FTM0_CH1_SHIFT        (4U)
/*! FTM0_CH1 - Assign movable function FTM0_CH1 */
#define SWM_FTM_PINASSIGN0_FTM0_CH1(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH1_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH1_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH2_MASK         (0xC0U)
#define SWM_FTM_PINASSIGN0_FTM0_CH2_SHIFT        (6U)
/*! FTM0_CH2 - Assign movable function FTM0_CH2 */
#define SWM_FTM_PINASSIGN0_FTM0_CH2(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH2_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH2_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH3_MASK         (0x300U)
#define SWM_FTM_PINASSIGN0_FTM0_CH3_SHIFT        (8U)
/*! FTM0_CH3 - Assign movable function FTM0_CH3 */
#define SWM_FTM_PINASSIGN0_FTM0_CH3(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH3_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH3_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH4_MASK         (0xC00U)
#define SWM_FTM_PINASSIGN0_FTM0_CH4_SHIFT        (10U)
/*! FTM0_CH4 - Assign movable function FTM0_CH4 */
#define SWM_FTM_PINASSIGN0_FTM0_CH4(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH4_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH4_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_CH5_MASK         (0x3000U)
#define SWM_FTM_PINASSIGN0_FTM0_CH5_SHIFT        (12U)
/*! FTM0_CH5 - Assign movable function FTM0_CH5 */
#define SWM_FTM_PINASSIGN0_FTM0_CH5(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_CH5_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_CH5_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_FAULT0_MASK      (0xC000U)
#define SWM_FTM_PINASSIGN0_FTM0_FAULT0_SHIFT     (14U)
/*! FTM0_FAULT0 - Assign movable function FTM0_FAULT0 */
#define SWM_FTM_PINASSIGN0_FTM0_FAULT0(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_FAULT0_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_FAULT0_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_FAULT1_MASK      (0x30000U)
#define SWM_FTM_PINASSIGN0_FTM0_FAULT1_SHIFT     (16U)
/*! FTM0_FAULT1 - Assign movable function FTM0_FAULT1 */
#define SWM_FTM_PINASSIGN0_FTM0_FAULT1(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_FAULT1_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_FAULT1_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_FAULT2_MASK      (0xC0000U)
#define SWM_FTM_PINASSIGN0_FTM0_FAULT2_SHIFT     (18U)
/*! FTM0_FAULT2 - Assign movable function FTM0_FAULT2 */
#define SWM_FTM_PINASSIGN0_FTM0_FAULT2(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_FAULT2_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_FAULT2_MASK)

#define SWM_FTM_PINASSIGN0_FTM0_FAULT3_MASK      (0x300000U)
#define SWM_FTM_PINASSIGN0_FTM0_FAULT3_SHIFT     (20U)
/*! FTM0_FAULT3 - Assign movable function FTM0_FAULT3 */
#define SWM_FTM_PINASSIGN0_FTM0_FAULT3(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM0_FAULT3_SHIFT)) & SWM_FTM_PINASSIGN0_FTM0_FAULT3_MASK)

#define SWM_FTM_PINASSIGN0_FTM1_EXTCLK_MASK      (0xC00000U)
#define SWM_FTM_PINASSIGN0_FTM1_EXTCLK_SHIFT     (22U)
/*! FTM1_EXTCLK - Assign movable function FTM1_EXTCLK */
#define SWM_FTM_PINASSIGN0_FTM1_EXTCLK(x)        (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM1_EXTCLK_SHIFT)) & SWM_FTM_PINASSIGN0_FTM1_EXTCLK_MASK)

#define SWM_FTM_PINASSIGN0_FTM1_CH0_MASK         (0x3000000U)
#define SWM_FTM_PINASSIGN0_FTM1_CH0_SHIFT        (24U)
/*! FTM1_CH0 - Assign movable function FTM1_CH0 */
#define SWM_FTM_PINASSIGN0_FTM1_CH0(x)           (((uint32_t)(((uint32_t)(x)) << SWM_FTM_PINASSIGN0_FTM1_CH0_SHIFT)) & SWM_FTM_PINASSIGN0_FTM1_CH0_MASK)

