nxp-mcuxpresso/mcux-sdk/devices/LPC864/LPC864.h
#define SYSCON_MAINCLKUEN_ENA_MASK               (0x1U)
#define SYSCON_MAINCLKUEN_ENA_SHIFT              (0U)
/*! ENA - Enable main clock source update
 *  0b0..no change
 *  0b1..update clock source
 */
#define SYSCON_MAINCLKUEN_ENA(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_MAINCLKUEN_ENA_SHIFT)) & SYSCON_MAINCLKUEN_ENA_MASK)
/*! @} */

/*! @name SYSAHBCLKDIV - System clock divider register */
/*! @{ */

#define SYSCON_SYSAHBCLKDIV_DIV_MASK             (0xFFU)
#define SYSCON_SYSAHBCLKDIV_DIV_SHIFT            (0U)
/*! DIV - System AHB clock divider values 0: System clock disabled. 1: Divide by 1. to 255: Divide by 255. */
#define SYSCON_SYSAHBCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKDIV_DIV_SHIFT)) & SYSCON_SYSAHBCLKDIV_DIV_MASK)
/*! @} */

/*! @name SYSPLLDIV - System clock divider register */
/*! @{ */

#define SYSCON_SYSPLLDIV_DIV_MASK                (0xFFU)
#define SYSCON_SYSPLLDIV_DIV_SHIFT               (0U)
/*! DIV - System PLL clock divider values 0: System PLL clock disabled. 1: Divide by 1. to 255: Divide by 255. */
#define SYSCON_SYSPLLDIV_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSPLLDIV_DIV_SHIFT)) & SYSCON_SYSPLLDIV_DIV_MASK)
/*! @} */

/*! @name ADCCLKSEL - ADC clock source select register */
/*! @{ */

#define SYSCON_ADCCLKSEL_SEL_MASK                (0x3U)
#define SYSCON_ADCCLKSEL_SEL_SHIFT               (0U)
/*! SEL - Clock source for ADC clock
 *  0b00..FRO
 *  0b01..sys pll
 *  0b10..none
 *  0b11..none
 */
#define SYSCON_ADCCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_ADCCLKSEL_SEL_SHIFT)) & SYSCON_ADCCLKSEL_SEL_MASK)
/*! @} */

/*! @name ADCCLKDIV - ADC clock divider register */
/*! @{ */

#define SYSCON_ADCCLKDIV_DIV_MASK                (0xFFU)
#define SYSCON_ADCCLKDIV_DIV_SHIFT               (0U)
/*! DIV - ADC clock divider values 0: ADC clock disabled. 1: Divide by 1. to 255: Divide by 255. */
#define SYSCON_ADCCLKDIV_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_ADCCLKDIV_DIV_SHIFT)) & SYSCON_ADCCLKDIV_DIV_MASK)
/*! @} */

/*! @name WKTCLKSEL - ADC clock source select register */
/*! @{ */

#define SYSCON_WKTCLKSEL_SEL_MASK                (0x1U)
#define SYSCON_WKTCLKSEL_SEL_SHIFT               (0U)
/*! SEL - WKT clock source selection
 *  0b0..FRO_INT
 *  0b1..LPOSC
 */
#define SYSCON_WKTCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_WKTCLKSEL_SEL_SHIFT)) & SYSCON_WKTCLKSEL_SEL_MASK)
/*! @} */

/*! @name EXTCLKSEL - external clock source select register */
/*! @{ */

#define SYSCON_EXTCLKSEL_SEL_MASK                (0x1U)
#define SYSCON_EXTCLKSEL_SEL_SHIFT               (0U)
/*! SEL - Clock source for external clock
 *  0b0..System oscillator
 *  0b1..Clk_in
 */
#define SYSCON_EXTCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_EXTCLKSEL_SEL_SHIFT)) & SYSCON_EXTCLKSEL_SEL_MASK)
/*! @} */

/*! @name I3CCLKDIV - I3C clock divider register */
/*! @{ */

#define SYSCON_I3CCLKDIV_I3C_FCLK_DIV_MASK       (0xFFU)
#define SYSCON_I3CCLKDIV_I3C_FCLK_DIV_SHIFT      (0U)
/*! I3C_FCLK_DIV - i3c_fclk fast clock divider */
#define SYSCON_I3CCLKDIV_I3C_FCLK_DIV(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CCLKDIV_I3C_FCLK_DIV_SHIFT)) & SYSCON_I3CCLKDIV_I3C_FCLK_DIV_MASK)

#define SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV_MASK (0xFF00U)
#define SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV_SHIFT (8U)
/*! I3C_SLOW_TC_CLK_DIV - i3c_slow_tc_clk clock divider */
#define SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV_SHIFT)) & SYSCON_I3CCLKDIV_I3C_SLOW_TC_CLK_DIV_MASK)

#define SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV_MASK   (0xFF0000U)
#define SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV_SHIFT  (16U)
/*! I3C_SLOW_CLK_DIV - i3c_slow_clk divider */
#define SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV_SHIFT)) & SYSCON_I3CCLKDIV_I3C_SLOW_CLK_DIV_MASK)
/*! @} */

/*! @name LPOSCEN - LPOSC enable register */
/*! @{ */

#define SYSCON_LPOSCEN_WDT_CLK_EN_MASK           (0x1U)
#define SYSCON_LPOSCEN_WDT_CLK_EN_SHIFT          (0U)
/*! WDT_CLK_EN - WDT count clock enable
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_LPOSCEN_WDT_CLK_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_LPOSCEN_WDT_CLK_EN_SHIFT)) & SYSCON_LPOSCEN_WDT_CLK_EN_MASK)

#define SYSCON_LPOSCEN_WKT_CLK_EN_MASK           (0x2U)
#define SYSCON_LPOSCEN_WKT_CLK_EN_SHIFT          (1U)
/*! WKT_CLK_EN - WDT count clock enable
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_LPOSCEN_WKT_CLK_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_LPOSCEN_WKT_CLK_EN_SHIFT)) & SYSCON_LPOSCEN_WKT_CLK_EN_MASK)
/*! @} */

/*! @name SYSAHBCLKCTRL0 - System clock group 0 control register */
/*! @{ */

#define SYSCON_SYSAHBCLKCTRL0_SYS_MASK           (0x1U)
#define SYSCON_SYSAHBCLKCTRL0_SYS_SHIFT          (0U)
/*! SYS - Enables the clock for the AHB, the APB bridge, the Cortex-M0+ core clocks, SYSCON, and the
 *    PMU. This bit is read only and always reads as 1.
 */
#define SYSCON_SYSAHBCLKCTRL0_SYS(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKCTRL0_SYS_SHIFT)) & SYSCON_SYSAHBCLKCTRL0_SYS_MASK)

#define SYSCON_SYSAHBCLKCTRL0_ROM_MASK           (0x2U)
#define SYSCON_SYSAHBCLKCTRL0_ROM_SHIFT          (1U)
/*! ROM - Enables clock for ROM.
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_SYSAHBCLKCTRL0_ROM(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKCTRL0_ROM_SHIFT)) & SYSCON_SYSAHBCLKCTRL0_ROM_MASK)

#define SYSCON_SYSAHBCLKCTRL0_RAM_MASK           (0x4U)
#define SYSCON_SYSAHBCLKCTRL0_RAM_SHIFT          (2U)
/*! RAM - Enables clock for SRAM.
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_SYSAHBCLKCTRL0_RAM(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKCTRL0_RAM_SHIFT)) & SYSCON_SYSAHBCLKCTRL0_RAM_MASK)

#define SYSCON_SYSAHBCLKCTRL0_FLASH_MASK         (0x10U)
#define SYSCON_SYSAHBCLKCTRL0_FLASH_SHIFT        (4U)
/*! FLASH - Enables clock for flash.
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_SYSAHBCLKCTRL0_FLASH(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKCTRL0_FLASH_SHIFT)) & SYSCON_SYSAHBCLKCTRL0_FLASH_MASK)

#define SYSCON_SYSAHBCLKCTRL0_I2C0_MASK          (0x20U)
#define SYSCON_SYSAHBCLKCTRL0_I2C0_SHIFT         (5U)
/*! I2C0 - Enables clock for I2C0.
 *  0b0..disable
 *  0b1..enable
 */
#define SYSCON_SYSAHBCLKCTRL0_I2C0(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_SYSAHBCLKCTRL0_I2C0_SHIFT)) & SYSCON_SYSAHBCLKCTRL0_I2C0_MASK)

