nxp-mcuxpresso/mcux-sdk/devices/LPC864/LPC864.h
/*! @name FCLKSEL - peripheral clock source select register. FCLK0SEL~FCLK2SEL are for UART0~UART2 clock source select register.FCLK3SEL~FCLK4SEL are reserved. FCLK5SEL is for I2C clock source select register. */
/*! @{ */

#define SYSCON_FCLKSEL_SEL_MASK                  (0x7U)
#define SYSCON_FCLKSEL_SEL_SHIFT                 (0U)
/*! SEL - Peripheral clock source
 *  0b000..FRO
 *  0b001..main clock
 *  0b010..Frg0clk
 *  0b011..Frg1clk
 *  0b100..FRO_DIV
 *  0b101..none
 *  0b110..none
 *  0b111..none
 */
#define SYSCON_FCLKSEL_SEL(x)                    (((uint32_t)(((uint32_t)(x)) << SYSCON_FCLKSEL_SEL_SHIFT)) & SYSCON_FCLKSEL_SEL_MASK)
/*! @} */

/* The count of SYSCON_FCLKSEL */
#define SYSCON_FCLKSEL_COUNT                     (6U)

/*! @name I3CCLKSEL - I3C clock source select register */
/*! @{ */

#define SYSCON_I3CCLKSEL_SEL_MASK                (0x7U)
#define SYSCON_I3CCLKSEL_SEL_SHIFT               (0U)
/*! SEL - I3C clock source
 *  0b000..FRO
 *  0b001..external clock
 *  0b010..None
 *  0b011..None
 *  0b100..None
 *  0b101..None
 *  0b110..None
 *  0b111..None
 */
#define SYSCON_I3CCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CCLKSEL_SEL_SHIFT)) & SYSCON_I3CCLKSEL_SEL_MASK)
/*! @} */

/*! @name I3CSLOWTCCLKSEL - I3CSLOWTC clock source select register */
/*! @{ */

#define SYSCON_I3CSLOWTCCLKSEL_SEL_MASK          (0x7U)
#define SYSCON_I3CSLOWTCCLKSEL_SEL_SHIFT         (0U)
/*! SEL - I3C clock source
 *  0b000..I3CFCLK
 *  0b001..Low power oscillator
 *  0b010..None
 *  0b011..None
 *  0b100..None
 *  0b101..None
 *  0b110..None
 *  0b111..None
 */
#define SYSCON_I3CSLOWTCCLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON_I3CSLOWTCCLKSEL_SEL_SHIFT)) & SYSCON_I3CSLOWTCCLKSEL_SEL_MASK)
/*! @} */

/*! @name FCLKSEL2 - peripheral clock source select register. FCLK0SEL2~FCLK2SEL2 are for SPI0~SPI1 clock source select register. */
/*! @{ */

#define SYSCON_FCLKSEL2_SEL_MASK                 (0x7U)
#define SYSCON_FCLKSEL2_SEL_SHIFT                (0U)
/*! SEL - Peripheral clock source
 *  0b000..FRO
 *  0b001..main clock
 *  0b010..Frg0clk
 *  0b011..Frg1clk
 *  0b100..FRO_DIV
 *  0b101..none
 *  0b110..none
 *  0b111..none
 */
#define SYSCON_FCLKSEL2_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << SYSCON_FCLKSEL2_SEL_SHIFT)) & SYSCON_FCLKSEL2_SEL_MASK)
/*! @} */

/* The count of SYSCON_FCLKSEL2 */
#define SYSCON_FCLKSEL2_COUNT                    (2U)

/*! @name FTM0INTTRIGDIV - FTM0INTTRIGDIV register */
/*! @{ */

#define SYSCON_FTM0INTTRIGDIV_FTM0_INT_TRIG_DIV_MASK (0x7FU)
#define SYSCON_FTM0INTTRIGDIV_FTM0_INT_TRIG_DIV_SHIFT (0U)
/*! FTM0_INT_TRIG_DIV - ftm0 ext_trigger_ftm0 or init_trigger_ftm0 divided by 1~128 */
#define SYSCON_FTM0INTTRIGDIV_FTM0_INT_TRIG_DIV(x) (((uint32_t)(((uint32_t)(x)) << SYSCON_FTM0INTTRIGDIV_FTM0_INT_TRIG_DIV_SHIFT)) & SYSCON_FTM0INTTRIGDIV_FTM0_INT_TRIG_DIV_MASK)
/*! @} */

/*! @name FTMFLTCFG - System clock divider register */
/*! @{ */

#define SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL_MASK (0x1U)
#define SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL_SHIFT (0U)
/*! FTM0_FAULT0_MUX_SEL - Mux selection FTM0 fault from external I/O or internal.
 *  0b0..Select external I/O
 *  0b1..Select internal
 */
#define SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL_SHIFT)) & SYSCON_FTMFLTCFG_FTM0_FAULT0_MUX_SEL_MASK)

#define SYSCON_FTMFLTCFG_FTM0_FAULT1_MUX_SEL_MASK (0x2U)
#define SYSCON_FTMFLTCFG_FTM0_FAULT1_MUX_SEL_SHIFT (1U)
/*! FTM0_FAULT1_MUX_SEL - Mux selection FTM0 fault from external I/O or internal.
 *  0b0..Select external I/O
 *  0b1..Select internal
 */
#define SYSCON_FTMFLTCFG_FTM0_FAULT1_MUX_SEL(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_FTMFLTCFG_FTM0_FAULT1_MUX_SEL_SHIFT)) & SYSCON_FTMFLTCFG_FTM0_FAULT1_MUX_SEL_MASK)

#define SYSCON_FTMFLTCFG_FTM0_FAULT2_MUX_SEL_MASK (0x4U)
#define SYSCON_FTMFLTCFG_FTM0_FAULT2_MUX_SEL_SHIFT (2U)
/*! FTM0_FAULT2_MUX_SEL - Mux selection FTM0 fault from external I/O or internal.
 *  0b0..Select external I/O
 *  0b1..Select internal
 */
#define SYSCON_FTMFLTCFG_FTM0_FAULT2_MUX_SEL(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_FTMFLTCFG_FTM0_FAULT2_MUX_SEL_SHIFT)) & SYSCON_FTMFLTCFG_FTM0_FAULT2_MUX_SEL_MASK)

#define SYSCON_FTMFLTCFG_FTM0_FAULT3_MUX_SEL_MASK (0x8U)
#define SYSCON_FTMFLTCFG_FTM0_FAULT3_MUX_SEL_SHIFT (3U)
/*! FTM0_FAULT3_MUX_SEL - Mux selection FTM0 fault from external I/O or internal.
 *  0b0..Select external I/O
 *  0b1..Select internal
 */
#define SYSCON_FTMFLTCFG_FTM0_FAULT3_MUX_SEL(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON_FTMFLTCFG_FTM0_FAULT3_MUX_SEL_SHIFT)) & SYSCON_FTMFLTCFG_FTM0_FAULT3_MUX_SEL_MASK)

#define SYSCON_FTMFLTCFG_FTM0_SW_FAULT_MASK      (0x10U)
#define SYSCON_FTMFLTCFG_FTM0_SW_FAULT_SHIFT     (4U)
/*! FTM0_SW_FAULT - Software fault. */
#define SYSCON_FTMFLTCFG_FTM0_SW_FAULT(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON_FTMFLTCFG_FTM0_SW_FAULT_SHIFT)) & SYSCON_FTMFLTCFG_FTM0_SW_FAULT_MASK)
/*! @} */

/*! @name FRG_FRGDIV - fractional generator N divider value register */
/*! @{ */

#define SYSCON_FRG_FRGDIV_DIV_MASK               (0xFFU)
#define SYSCON_FRG_FRGDIV_DIV_SHIFT              (0U)
/*! DIV - Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set
 *    to 0xFF to use with the fractional baud rate generator.
 */
#define SYSCON_FRG_FRGDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << SYSCON_FRG_FRGDIV_DIV_SHIFT)) & SYSCON_FRG_FRGDIV_DIV_MASK)
/*! @} */

/* The count of SYSCON_FRG_FRGDIV */
#define SYSCON_FRG_FRGDIV_COUNT                  (2U)

/*! @name FRG_FRGMULT - fractional generator N multiplier value register */
/*! @{ */

#define SYSCON_FRG_FRGMULT_MULT_MASK             (0xFFU)
#define SYSCON_FRG_FRGMULT_MULT_SHIFT            (0U)
/*! MULT - Numerator of the fractional divider. MULT is equal to the programmed value. */
#define SYSCON_FRG_FRGMULT_MULT(x)               (((uint32_t)(((uint32_t)(x)) << SYSCON_FRG_FRGMULT_MULT_SHIFT)) & SYSCON_FRG_FRGMULT_MULT_MASK)
/*! @} */

